src/InformationRegisters/СостоянияКонтроляРелизов/СостоянияКонтроляРелизов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияКонтроляРелизов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбнаруженияВерсии</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаКонтрольногоСрока</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПланируемойУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоУведомлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПоследнегоУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринялРешение</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбновления</name>
    <type>
      <types>CatalogRef.КлючиОбновлений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЖурналУведомленийОбОбновлениях/ЖурналУведомленийОбОбновлениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналУведомленийОбОбновлениях</name>
  <resources>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипУведомления</name>
    <type>
      <types>EnumRef.ТипыУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбновления</name>
    <type>
      <types>CatalogRef.КлючиОбновлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.СпособыУведомления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьПисемОбОбновлениях/ОчередьПисемОбОбновлениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПисемОбОбновлениях</name>
  <resources>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Письмо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияКонтроляРасширений/СостоянияКонтроляРасширений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияКонтроляРасширений</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбнаруженияВерсии</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаКонтрольногоСрока</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПланируемойУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоУведомлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПоследнегоУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринялРешение</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасширениеКонфигурации</name>
    <type>
      <types>CatalogRef.РасширенияКонфигураций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтроляРелизов/НастройкиКонтроляРелизов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтроляРелизов</name>
  <resources>
    <name>КонтрольАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонУведомления</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </resources>
  <resources>
    <name>РекомендуемыйСрокУстановкиВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьПовторныеУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонПовторногоУведомления</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПовторныхУведомленийВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъектаИБ</name>
    <type>
      <types>EnumRef.ТипыОбъектовИБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектИБ</name>
    <type>
      <types>DefinedType.ОбъектИБ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСостояния/СтатусыСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСостояния</name>
  <enumValues>
    <name>НоваяВерсияДоступна</name>
  </enumValues>
  <enumValues>
    <name>ОжидаениеРеакции</name>
  </enumValues>
  <enumValues>
    <name>ПланируетсяУстановка</name>
  </enumValues>
  <enumValues>
    <name>ПропущенРелиз</name>
  </enumValues>
  <enumValues>
    <name>Установлено</name>
  </enumValues>
  <enumValues>
    <name>Просрочено</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СпособыУведомления/СпособыУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУведомления</name>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыУведомлений/ТипыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУведомлений</name>
  <enumValues>
    <name>Первичное</name>
  </enumValues>
  <enumValues>
    <name>Повторное</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/КонтрольРелизовУведомления/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует уведомления для ответственных за обновления конфигурации
//
Процедура ФормированиеОповещенийОбОбновлениях() Экспорт

	Попытка
		ФормированиеУведомлений();
	Исключение
		ЗаписьЖурналаРегистрации(
			"КонтрольРелизов.ФормированиеУведомлений", 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Отправляет письма из очереди на электронную почту
//
Процедура ОтправкаПисемИзОчереди() Экспорт
	
	Попытка
		ОтправитьОжидающиеПисьма();
	Исключение
		ЗаписьЖурналаРегистрации(
			"КонтрольРелизов.ОтправкаПисемИзОчереди",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Формирует уведомления для ответственных за обновления расширений конфигурации
//
Процедура ФормированиеОповещенийОбРасширениях() Экспорт

	Попытка
		ФормированиеУведомленийРасширения();
	Исключение
		ЗаписьЖурналаРегистрации(
			"КонтрольРелизов.ФормированиеУведомленийРасширения", 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

Процедура ФормированиеУведомлений()
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	АдресОтправителя = АдресСистемнойУчетнойЗаписиЭлектроннойПочты();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаКандидатовНаУведомление();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("СтатусПланируется", Перечисления.СтатусыСостояния.ПланируетсяУстановка);
	Запрос.УстановитьПараметр("СтатусПросрочено", Перечисления.СтатусыСостояния.Просрочено);
	
	ТаблицаКандидатов = Запрос.Выполнить().Выгрузить();	
	Если ТаблицаКандидатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УникальныеИБ = ТаблицаКандидатов.Скопировать(, "ИнформационнаяБаза");
	УникальныеИБ.Свернуть("ИнформационнаяБаза");
	
	Для Каждого СтрИБ Из УникальныеИБ Цикл
		
		ИнформационнаяБаза = СтрИБ.ИнформационнаяБаза;
		СтрокиПоИБ = ТаблицаКандидатов.НайтиСтроки(Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза));
		
		Если СтрокиПоИБ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлок = Блокировка.Добавить("РегистрСведений.СостоянияКонтроляРелизов");
			ЭлементБлок.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлок.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлок = Блокировка.Добавить("РегистрСведений.ЖурналУведомленийОбОбновлениях");
			ЭлементБлок.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлок.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			Получатели = ОтветственныеЛица.ПолучитьАктуальныйСостав(
				ТекущаяДата, 
				ИнформационнаяБаза.Организация,
				ИнформационнаяБаза
			);
			
			Если Получатели.Количество() = 0 Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЭлАдресаПолучателей = Получатели.Скопировать(, "Email");
			ЭлАдресаПолучателей.Свернуть("Email");
			
			Для Каждого СтрокаВыборки Из СтрокиПоИБ Цикл
				
				ИдентификаторУведомления = Строка(Новый УникальныйИдентификатор);
				ИдентификаторПисьма = Строка(Новый УникальныйИдентификатор);
				
				ШаблонДляИспользования = ?(СтрокаВыборки.ЭтоПовторное, СтрокаВыборки.ШаблонПовторного, СтрокаВыборки.ШаблонПервичного);
				
				ДанныеПисьма = ШаблоныСообщений.СформироватьСообщение(ШаблонДляИспользования, СтрокаВыборки.КлючОбновления, ИдентификаторПисьма);
				
				Для Каждого Получатель Из Получатели Цикл
					ЗаписатьУведомлениеВЖурнал(
						СтрокаВыборки, 
						Получатель, 
						ДанныеПисьма, 
						ИдентификаторУведомления, 
						ИдентификаторПисьма, 
						ТекущаяДата
					);
					КонецЦикла;	
					
					Письмо = СформироватьПисьмоСАдресомОтправителя(ДанныеПисьма, АдресОтправителя, ЭлАдресаПолучателей);
					
					ЗаписатьПисьмоВОчередь(Письмо, ТекущаяДата, ИдентификаторПисьма, ИдентификаторУведомления);

				
				ОбновитьСостояниеПослеУведомления(СтрокаВыборки, ТекущаяДата);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				"КонтрольРелизов.ОбработкаИБ", 
				УровеньЖурналаРегистрации.Ошибка, 
				, 
				ИнформационнаяБаза, 
				"Ошибка при формировании уведомлений: " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры 

Функция СформироватьПисьмоСАдресомОтправителя(ДанныеПисьма, АдресОтправителя, ЭлАдресаПолучателей)
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Кодировка = "utf-8";
	
	Для Каждого ЭлАдрес Из ЭлАдресаПолучателей Цикл
		Письмо.Получатели.Добавить(ЭлАдрес.Email);
	КонецЦикла;
	
	Письмо.Отправитель = АдресОтправителя;
	
	Письмо.Тексты.Добавить(ДанныеПисьма.Текст, ТипТекстаПочтовогоСообщения.HTML);
	Для Каждого Текст Из Письмо.Тексты Цикл
		Текст.Кодировка = "utf-8";
	КонецЦикла;
	
	Возврат Письмо;
	
КонецФункции

Функция СформироватьПисьмо(ДанныеПисьма, УчетнаяЗапись, ЭлАдресаПолучателей)
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Кодировка = "utf-8";
	
	Для Каждого ЭлАдрес Из ЭлАдресаПолучателей Цикл
		Письмо.Получатели.Добавить(ЭлАдрес.Email);
	КонецЦикла;
	
	Письмо.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	
	Письмо.Тексты.Добавить(ДанныеПисьма.Текст, ТипТекстаПочтовогоСообщения.HTML);
	Для Каждого Текст Из Письмо.Тексты Цикл
		Текст.Кодировка = "utf-8";
	КонецЦикла;
	
	Письмо.Тема = ДанныеПисьма.Тема;
	
	Возврат Письмо;
	
КонецФункции

Процедура ЗаписатьУведомлениеВЖурнал(ДанныеОбновления, ПолучательСтруктура, ДанныеПисьма, ИдентификаторУведомления, ИдентификаторПисьма, ТекущаяДата)
	
	Запись = РегистрыСведений.ЖурналУведомленийОбОбновлениях.СоздатьМенеджерЗаписи();
	
	Запись.ИнформационнаяБаза	= ДанныеОбновления.ИнформационнаяБаза;
	Запись.КлючОбновления		= ДанныеОбновления.КлючОбновления;
	Запись.Получатель			= ПолучательСтруктура.Ответственный; 
	Запись.СпособУведомления	= Перечисления.СпособыУведомления.ЭлектроннаяПочта;
	Запись.ИдентификаторУведомления = ИдентификаторУведомления;
	Запись.ИдентификаторПисьма	= ИдентификаторПисьма;
	
	Запись.ДатаДобавления		= ТекущаяДата;
	Запись.ТемаСообщения		= ДанныеПисьма.Тема;
	Запись.ТекстСообщения		= ДанныеПисьма.Текст;
	
	Запись.ТипУведомления = ?(ДанныеОбновления.ЭтоПовторное, 
		Перечисления.ТипыУведомлений.Повторное, 
		Перечисления.ТипыУведомлений.Первичное);
	
	Запись.НомерПовтора = ДанныеОбновления.КоличествоУведомлений + 1;
	
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗаписатьПисьмоВОчередь(Письмо, ДатаДобавления, ИдентификаторПисьма, ИдентификаторУведомления)
	
	Запись = РегистрыСведений.ОчередьПисемОбОбновлениях.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторПисьма		= ИдентификаторПисьма;
	Запись.ДатаДобавления			= ДатаДобавления;
	Запись.Письмо					= Новый ХранилищеЗначения(Письмо);
	Запись.ИдентификаторУведомления	= ИдентификаторУведомления;
	
	Запись.Записать();
	
КонецПроцедуры   

Процедура ОбновитьСостояниеПослеУведомления(ДанныеВыборки, ТекущаяДата)
	
	Набор = РегистрыСведений.СостоянияКонтроляРелизов.СоздатьНаборЗаписей();
	Набор.Отбор.ИнформационнаяБаза.Установить(ДанныеВыборки.ИнформационнаяБаза);
	Набор.Отбор.КлючОбновления.Установить(ДанныеВыборки.КлючОбновления);
	Набор.Прочитать();

	Если Набор.Количество() > 0 Тогда
		Запись = Набор[0];
		Запись.КоличествоУведомлений = Запись.КоличествоУведомлений + 1;
		Запись.ДатаПоследнегоУведомления = ТекущаяДата;
		Набор.Записать();
	КонецЕсли; 
	
КонецПроцедуры


Процедура ОтправитьОжидающиеПисьма()
	
	ТекущаяДата = ТекущаяДатаСеанса();
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Очередь.ИдентификаторПисьма КАК ИдентификаторПисьма,
		|	Очередь.ДатаДобавления КАК ДатаДобавления,
		|	Очередь.ИдентификаторУведомления КАК ИдентификаторУведомления
		|ИЗ
		|	РегистрСведений.ОчередьПисемОбОбновлениях КАК Очередь
		|ГДЕ
		|	Очередь.ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьПисемОбОбновлениях");
			ЭлементБлокировки.УстановитьЗначение("ИдентификаторПисьма", Выборка.ИдентификаторПисьма);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			НаборОчереди = РегистрыСведений.ОчередьПисемОбОбновлениях.СоздатьНаборЗаписей();
			НаборОчереди.Отбор.ИдентификаторПисьма.Установить(Выборка.ИдентификаторПисьма);
			НаборОчереди.Прочитать();
			
			Если НаборОчереди.Количество() = 0 Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ТекущаяЗапись = НаборОчереди[0];
			Если ЗначениеЗаполнено(ТекущаяЗапись.ДатаОтправки) Тогда
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		Письмо = ТекущаяЗапись.Письмо.Получить();
		Если Письмо = Неопределено Тогда
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		// Отправка
		РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);

			
			// Успешно — фиксируем дату отправки
			ТекущаяЗапись.ДатаОтправки = ТекущаяДата;
			НаборОчереди.Записать();
			
			// Обновляем все связанные уведомления в журнале
			ОбновитьДатыОтправкиВЖурналеУведомлений(Выборка.ИдентификаторПисьма, ТекущаяДата);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(
				"КонтрольРелизов.ОтправкаПисьма",
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.ИдентификаторПисьма,
				"Ошибка отправки письма " + Выборка.ИдентификаторПисьма + ": " +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			
			// Письмо остаётся в очереди для следующей попытки
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДатыОтправкиВЖурналеУведомлений(ИдентификаторПисьма, ДатаОтправки)
	
	Набор = РегистрыСведений.ЖурналУведомленийОбОбновлениях.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторПисьма.Установить(ИдентификаторПисьма);
	Набор.Отбор.ДатаОтправки.Установить(Дата('00010101'));
	
	Набор.Прочитать();
	
	Для Каждого Запись Из Набор Цикл
		Запись.ДатаОтправки = ДатаОтправки;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Процедура ФормированиеУведомленийРасширения()
	
	ТекущаяДата = ТекущаяДатаСеанса();
	АдресОтправителя = АдресСистемнойУчетнойЗаписиЭлектроннойПочты();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаКандидатовНаУведомлениеРасширения();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("СтатусПланируется", Перечисления.СтатусыСостояния.ПланируетсяУстановка);
	Запрос.УстановитьПараметр("СтатусПросрочено", Перечисления.СтатусыСостояния.Просрочено);
	
	ТаблицаКандидатов = Запрос.Выполнить().Выгрузить();
	Если ТаблицаКандидатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УникальныеИБ = ТаблицаКандидатов.Скопировать(, "ИнформационнаяБаза");
	УникальныеИБ.Свернуть("ИнформационнаяБаза");
	
	Для Каждого СтрИБ Из УникальныеИБ Цикл
		
		ИнформационнаяБаза = СтрИБ.ИнформационнаяБаза;
		СтрокиПоИБ = ТаблицаКандидатов.НайтиСтроки(Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза));
		
		Если СтрокиПоИБ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлок = Блокировка.Добавить("РегистрСведений.СостоянияКонтроляРасширений");
			ЭлементБлок.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлок.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлок = Блокировка.Добавить("РегистрСведений.ЖурналУведомленийОбОбновлениях");
			ЭлементБлок.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлок.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			Получатели = ОтветственныеЛица.ПолучитьОтветственныхЗаРасширенияПоСпискуИБ(
				Новый Массив(ИнформационнаяБаза),
				ТекущаяДата
			);
			
			Если Получатели.Количество() = 0 Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЭлАдресаПолучателей = Получатели.Скопировать(, "Email");
			ЭлАдресаПолучателей.Свернуть("Email");
			
			Для Каждого СтрокаВыборки Из СтрокиПоИБ Цикл
				ИдентификаторСостояния = Строка(Новый УникальныйИдентификатор);
				ИдентификаторПисьма = Строка(Новый УникальныйИдентификатор);
				
				ШаблонДляИспользования = ?(СтрокаВыборки.ЭтоПовторное, 
					СтрокаВыборки.ШаблонПовторного, 
					СтрокаВыборки.ШаблонПервичного);
				
				ДанныеПисьма = ШаблоныСообщений.СформироватьСообщение(
					ШаблонДляИспользования, 
					СтрокаВыборки.РасширениеКонфигурации, 
					ИдентификаторПисьма
				);
				
				Для Каждого Получатель Из Получатели Цикл
					ЗаписатьУведомлениеВЖурналРасширения(
						СтрокаВыборки, 
						Получатель, 
						ДанныеПисьма, 
						ИдентификаторСостояния, 
						ИдентификаторПисьма, 
						ТекущаяДата
					);
					КонецЦикла;	
					
				Письмо = СформироватьПисьмоСАдресомОтправителя(ДанныеПисьма, АдресОтправителя, ЭлАдресаПолучателей);
				
				ЗаписатьПисьмоВОчередь(Письмо, ТекущаяДата, ИдентификаторПисьма, ИдентификаторСостояния);


				
				ОбновитьСостояниеРасширенияПослеУведомления(СтрокаВыборки, ТекущаяДата, ИдентификаторСостояния);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				"КонтрольРелизов.ОбработкаРасширений", 
				УровеньЖурналаРегистрации.Ошибка, 
				, 
				ИнформационнаяБаза, 
				"Ошибка при формировании уведомлений для расширений: " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьУведомлениеВЖурналРасширения(ДанныеСостояния, ПолучательСтруктура, ДанныеПисьма, ИдентификаторСостояния, ИдентификаторПисьма, ТекущаяДата)
	
	Набор = РегистрыСведений.ЖурналУведомленийОбОбновлениях.СоздатьНаборЗаписей();
	Набор.Отбор.ИнформационнаяБаза.Установить(ДанныеСостояния.ИнформациБаза);
	Набор.Отбор.РасширениеКонфигурации.Установить(ДанныеСостояния.РасширениеКонфигурации);
	
	Запись = Набор.Добавить();
	Запись.ИнформационнаяБаза = ДанныеСостояния.ИнформационнаяБаза;
	Запись.РасширениеКонфигурации = ДанныеСостояния.РасширениеКонфигурации;
	Запись.Получатель = ПолучательСтруктура.Ответственный;
	Запись.СпособУведомления = Перечисления.СпособыУведомления.ЭлектроннаяПочта;
	Запись.ИдентификаторУведомления = ИдентификаторСостояния;
	Запись.ИдентификаторПисьма = ИдентификаторПисьма;
	
	Запись.ДатаДобавления = ТекущаяДата;
	Запись.ТемаСообщения = ДанныеПисьма.Тема;
	Запись.ТекстСообщения = ДанныеПисьма.Текст;
	
	Запись.ТипУведомления = ?(ДанныеСостояния.ЭтоПовторное, 
		Перечисления.ТипыУведомлений.Повторное, 
		Перечисления.ТипыУведомлений.Первичное);
	
	Запись.НомерПовтора = ДанныеСостояния.КоличествоУведомлений + 1;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Процедура ОбновитьСостояниеРасширенияПослеУведомления(ДанныеВыборки, ТекущаяДата, ИдентификаторСостояния)
	
	Набор = РегистрыСведений.СостоянияКонтроляРасширений.СоздатьНаборЗаписей();
	Набор.Отбор.ИнформационнаяБаза.Установить(ДанныеВыборки.ИнформационнаяБаза);
	Набор.Отбор.РасширениеКонфигурации.Установить(ДанныеВыборки.РасширениеКонфигурации);
	Набор.Отбор.ВерсияРасширения.Установить(ДанныеВыборки.ВерсияРасширения);
	
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		Запись = Набор[0];
		Запись.ДатаПоследнегоУведомления = ТекущаяДата;
		Запись.КоличествоУведомлений = Запись.КоличествоУведомлений + 1;
		Запись.ИдентификаторПоследнегоУведомления = ИдентификаторСостояния;
	Набор.Записать();
	Иначе
		Запись = Набор.Добавить();
		Запись.ИнформационнаяБаза = ДанныеВыборки.ИнформационнаяБаза;
		Запись.РасширениеКонфигурации = ДанныеВыборки.РасширениеКонфигурации;
		Запись.ВерсияРасширения = ДанныеВыборки.ВерсияРасширения;
		Запись.Статус = Перечисления.СтатусыСостояния.ПланируетсяУстановка;
		Запись.ДатаОбнаруженияВерсии = ТекущаяДата;
		Запись.ДатаКонтрольногоСрока = ДанныеВыборки.ДатаКонтрольногоСрока;
		Запись.ДатаПланируемойУстановки = ДанныеВыборки.ДатаПланируемойУстановки;
		Запись.ДатаПоследнегоУведомления = ТекущаяДата;
		Запись.КоличествоУведомлений = 1;
		Запись.ИдентификаторСостояния = ИдентификаторСостояния;
		Запись.ИдентификаторПоследнегоУведомления = ИдентификаторСостояния;
		Запись.ПринялРешение = ДанныеВыборки.ПринялРешение;
		Набор.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

// Возвращает адрес электронной почты системной учетной записи
//
Функция АдресСистемнойУчетнойЗаписиЭлектроннойПочты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУ.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК СУ
		|ГДЕ
		|	СУ.Ссылка = &СистемнаяУчетнаяЗапись";
	
	Запрос.УстановитьПараметр("СистемнаяУчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Результат.Выгрузить()[0].АдресЭлектроннойПочты;
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаКандидатовНаУведомление()

	Возврат 
		"ВЫБРАТЬ
		|	Состояния.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Состояния.ИнформационнаяБаза.Наименование КАК ИмяБазы,
		|	Состояния.КлючОбновления КАК КлючОбновления,
		|	Состояния.КлючОбновления.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	Состояния.КлючОбновления.ОбъектИБ КАК ОбъектИБ,
		|	Состояния.КлючОбновления.ТекущаяВерсия КАК ТекущаяВерсия,
		|	Состояния.КлючОбновления.НоваяВерсия КАК НоваяВерсия,
		|	Состояния.ДатаКонтрольногоСрока КАК ДатаКонтрольногоСрока,
		|	Состояния.КоличествоУведомлений КАК КоличествоУведомлений,
		|	ВЫБОР
		|		КОГДА Состояния.Статус = &СтатусПросрочено
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПовторное,
		|	Настройки.ШаблонУведомления КАК ШаблонПервичного,
		|	Настройки.ШаблонПовторногоУведомления КАК ШаблонПовторного
		|ИЗ
		|	РегистрСведений.СостоянияКонтроляРелизов КАК Состояния
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиКонтроляРелизов КАК Настройки
		|		ПО Состояния.ИнформационнаяБаза = Настройки.ИнформационнаяБаза
		|			И Состояния.КлючОбновления.ТипОбъектаИБ = Настройки.ТипОбъектаИБ
		|			И Состояния.КлючОбновления.ОбъектИБ = Настройки.ОбъектИБ
		|ГДЕ
		|	Настройки.КонтрольАктивен = ИСТИНА
		|	И (Состояния.Статус = &СтатусПланируется
		|				И Состояния.КоличествоУведомлений = 0
		|			ИЛИ Состояния.Статус = &СтатусПросрочено
		|				И Настройки.ОтправлятьПовторныеУведомления = ИСТИНА
		|				И Состояния.КоличествоУведомлений < Настройки.МаксимальноеКоличествоПовторов
		|				И (Состояния.ДатаПоследнегоУведомления = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДОБАВИТЬКДАТЕ(Состояния.ДатаПоследнегоУведомления, ДЕНЬ, Настройки.ИнтервалПовторныхУведомленийВДнях) <= &ТекущаяДата))";
	
КонецФункции

Функция ТекстЗапросаКандидатовНаУведомлениеРасширения()

	Возврат 
		"ВЫБРАТЬ
		|	Состояния.ИнформационнаяБаза КАК ИнформациБаза,
		|	Состояния.РасширениеКонфигурации КАК РасширениеКонфигурации,
		|	Состояния.ВерсияРасширения КАК ВерсияРасширения,
		|	Состояния.Статус КАК Статус,
		|	Состояния.ДатаОбнаруженияВерсии КАК ДатаОбнаруженияВерсии,
		|	Состояния.ДатаПланируемойУстановки КАК ДатаПланируемойУстановки,
		|	Состояния.ДатаКонтрольногоСрока КАК ДатаКонтрольногоСрока,
		|	Состояния.КоличествоУведомлений КАК КоличествоУведомлений,
		|	Состояния.ПринялРешение КАК ПринялРешение,
		|	ВЫБОР
		|		КОГДА Состояния.Статус = &СтатусПросрочено
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПовторное,
		|	Настройки.ШаблонУведомления КАК ШаблонПервичного,
		|	Настройки.ШаблонПовторногоУведомления КАК ШаблонПовторного
		|ИЗ
		|	РегистрСведений.СостоянияКонтроляРасширений КАК Состояния
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиКонтроляРелизов КАК Настройки
		|		ПО Состояния.ИнформационнаяБаза = Настройки.ИнформационнаяБаза
		|		И Состояния.РасширениеКонфигурации = Настройки.ОбъектИБ
		|ГДЕ
		|	Настройки.КонтрольАктивен = ИСТИНА
		|	И (Состояния.Статус = &СтатусПланируется
		|			И Состояния.КоличествоУведомлений = 0
		|		ИЛИ Состояния.Статус = &СтатусПросрочено
		|			И Настройки.ОтправлятьПовторныеУведомления = ИСТИНА
		|			И Состояния.КоличествоУведомлений < Настройки.МаксимальноеКоличествоПовторов
		|			И (Состояния.ДатаПоследнегоУведомления = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДОБАВИТЬКДАТЕ(Состояния.ДатаПоследнегоУведомления, ДЕНЬ, Настройки.ИнтервалПовторныхУведомленийВДнях) <= &ТекущаяДата))";

КонецФункции

#КонецОбласти
